{"type":"FeatureCollection","features":[{"type":"Feature","geometry":{"type":"Point","coordinates":[-78.861393,35.9028563]},"properties":{"Name":"First Flight Venture Center","logobg":"y","logofile":"FFVCLogo.png","Address":"2 Davis Drive, Research Triangle Park, NC 27709, USA","Contact":"info@firstflightventure.org","Website":"https://ffvcnc.org/","Capabilities":"FFVC is a &quot;High Science, High Impact&quot; technology incubator whose resident startups work on solving important issues related to healthcare, energy, materials, and IT.","Powers":"The overall goal of the project is to populate the BARDA R&D pipeline with technologies originating from the Research Triangle region of North Carolina.  FFVC  performs outreach activities, evaluate emerging innovations, provide business mentoring, technical support, and grant writing services."}},{"type":"Feature","geometry":{"type":"Point","coordinates":[-118.4496013,34.06226]},"properties":{"Name":"MedTech Innovator","logofile":"MedTechInnovatorColorLogo.png","Address":"10958 Weyburn Ave, Ste 216, Los Angeles, CA 90024, USA","Contact":"info@medtechinnovator.org","Capabilities":"MedTech Innovator is a nonprofit global accelerator for medical device, digital health, and diagnostic companies. Since 2013, MedTech Innovator has graduated 135 startups that have raised nearly $550M in follow-on funding, launched 24 products on the market, and achieved five exits. MedTech Innovator has established partnerships with Amgen, BTG, Baxter, BD, EdgeOne Medical, HOYA, Johnson & Johnson, Nipro, Olympus, RCT Ventures, W. L. Gore, and Ximedica. ","Powers":"As a member of the BARDA DRIVe Accelerator Network, MedTech  Innovator sources a diversified pipeline of early stage companies across medical device, diagnostic,  and digital sectors and provide an unparalleled network of mentorship, resources, and exposure for DRIVe  Accelerator companies. ","logobg":"y","Website":"https://medtechinnovator.org/"}},{"type":"Feature","geometry":{"type":"Point","coordinates":[-90.074865,29.957458]},"properties":{"Name":"New Orleans BioInnovation Center","Address":"1441 Canal St, New Orleans, LA 70112, USA","logofile":"New Orleans BioInnovation.png","Contact":"info@neworleansbio.com","Capabilities":"The New Orleans BioInnovation Center is a private, not-for-profit life science business incubator comprised of 3 divisions: (1) a 66,000 square foot wet-lab facility, (2) a professional Commercialization Team, and (3) New Orleans BioFund, an independent subsidiary, which provides early-stage capital for emerging ventures.  The Center works directly with entrepreneurs and researchers to commercialize new technologies spinning out of universities and healthcare institutions, to start and scale globally competitive life science companies.","Powers":"The New Orleans Biolnnovation Center leverages their incubator operation and work with research institutions to  identify promising technologies and bring together the network of resources that will prepare the  researchers and entrepreneurs for the full business development process. ","logobg":"y","Website":"https://www.neworleansbio.com/"}},{"type":"Feature","geometry":{"type":"Point","coordinates":[-73.1201183795929,40.9121828883033]},"properties":{"Name":"The Center for Biotechnology at Stony Brook University","Address":"Bioengineering Building, Level 2, Stony Brook University, Stony Brook, NY  11794-5281","logofile":"CFBLogo.fw.png","Contact":"center_for_biotechnology@stonybrook.edu","Capabilities":"Established in 1983, the CfB implemented one of the nation&rsquo;s  first university-based &quot;seed funds,&quot; and has contributed to the development of dozens of commercial  products from the academic sector, including ReoPro&#174;, Xiafle&#174; and Periostat&#174;, and company  formation including Collagenex, Codagenix, Celmatix and Applied DNA Sciences. ","Powers":"CfB provides accelerator services that  guide early-stage technology development, facilitate direct commercial partnerships, foster  professionally managed and investable company formation, and prepare entrepreneurs for their first  round of professional financing or strategic partnership. ","logobg":"y","Website":"http://centerforbiotechnology.org/"}},{"type":"Feature","geometry":{"type":"Point","coordinates":[-95.397822,29.709689]},"properties":{"Name":"Texas Medical Center Innovation Institute","Address":"2450 Holcombe Boulevard, Suite X, Houston, TX 77021, USA","logofile":"TMC Innovation.png","Contact":"tmcx@tmc.edu","Capabilities":"The TMC Innovation  Institute focuses on  bringing the best  solutions to unmet  healthcare needs by  providing the tools and  action plans necessary  to move products and  companies forward, regardless of their stage of development. It opens access to hospital stakeholders and key opinion leaders across the TMC campus. The Innovation Institute is  composed of leading industry partners including Johnson&Johnson and AT&T Foundry.","Powers":"TMC brings the best solutions to unmet healthcare needs  by providing the tools and action plans necessary to move products and companies toward  commercialization, regardless of their stage of development. ","logobg":"y","Website":"http://www.tmc.edu/innovation/"}},{"type":"Feature","geometry":{"type":"Point","coordinates":[-75.180511,39.954491]},"properties":{"Name":"University City Science Center","Address":"3711 Market St, Philadelphia, PA 19104, USA","logofile":"Science-Center-logo.png","Contact":"\"info@sciencecenter.org  \"","Capabilities":"The Science Center is a mission-driven nonprofit organization that helps innovators and entrepreneurs in Pennsylvania, New Jersey and Delaware bring world-changing technologies to market. We provide innovators, entrepreneurs and companies at any stage of the business lifecycle with support and access to resources, programming, capital, and space - helping move innovation from idea to IPO, and beyond.","Powers":"The Science Center is a mission-driven nonprofit organization that helps innovators and entrepreneurs in Pennsylvania, New Jersey and Delaware bring world-changing technologies to market. We provide innovators, entrepreneurs and companies at any stage of the business lifecycle with support and access to resources, programming, capital, and space - helping move innovation from idea to IPO, and beyond.","logobg":"y","Website":"https://www.sciencecenter.org/"}},{"type":"Feature","geometry":{"type":"Point","coordinates":[-71.314206,42.641965]},"properties":{"Name":"Massachusetts Medical Device Development Center","Address":"One University Avenue, Lowell, MA 01854, USA","logofile":"M2D2_logo.png","Contact":"M2D2@uml.edu","Capabilities":"The Massachusetts Medical Device Development (M2D2) Center is a highly successful medical device  accelerator and incubator. This center combines the engineering and business expertise of University of  Massachusetts Lowell with the clinical development expertise of University of Massachusetts Medical  School. We have an existing leadership and governance model that is readily adapted to the needs of the  PAHS@M2D2.","Powers":"PAHS@M2D2 develops and optimizes novel technologies that promote national health security  innovation.  zThey integrate scientific product development, business  development, clinical expertise, and regulatory expertise to identify promising medical products and mentor  small companies through alliances with external partners and large companies. The geographic region for  the PAHS@M2D2 is Region 2 - Greater Boston. Lowell and Worcester ","logobg":"y","Website":"https://www.uml.edu/Research/M2D2/"}},{"type":"Feature","geometry":{"type":"Point","coordinates":[-122.32554,47.634942]},"properties":{"Name":"Life Science Washington Institute","Address":"1551 Eastlake Ave E, Suite 300, Seattle, WA 98102, USA","logofile":"Life Science Washington Institute.svg","Contact":"info@lswinstitute.org","Capabilities":"Life Science Washington Institute is a 501(c)(3) non-profit organization that assists life science researchers, entrepreneurs, and companies in bridging the gap between discovery and commercialization. Their mission is to provide support to life science entrepreneurs and start-up companies via educational, economic and other resources crucial for their success.","Powers":"Life Science Washington Institute is a 501(c)(3) non-profit organization that assists life science researchers, entrepreneurs, and companies in bridging the gap between discovery and commercialization. Their mission is to provide support to life science entrepreneurs and start-up companies via educational, economic and other resources crucial for their success.","logobg":"y","Website":"https://www.lswinstitute.org/"}},{"type":"Feature","geometry":{"type":"Point","coordinates":[-86.914391,40.428246]},"properties":{"Name":"Purdue University","Address":"1203 W State St, West Lafayette, IN 47906","logofile":"purdue_logo.png","Contact":"mpoderyc@purdue.edu ","Capabilities":"The Purdue Discovery to Innovation Accelerator, located in Discovery Park's Bindley Bioscience Center, is tasked with launching life sciences discoveries down a commercialization path. In close cooperation with comprehensive technical and business partnerships at Purdue University and numerous industry and academic partners across the state of Indiana, the goal is to ensure that the inventors of cutting-edge technologies with biological/medical applications are supported as they advance from (A) proof of concept to (Z) product launch.    ","Powers":"","logobg":"y","Website":"https://www.purdue.edu/discoverypark/bioscience/facilities/accelerator.php"}},{"type":"Feature","geometry":{"type":"Point","coordinates":[-122.0159792,37.3842866]},"properties":{"Name":"Plug and Play Health","Address":"440 N Wolfe Rd, Sunnyvale, CA 94085","logofile":"plugandplay-logo.png","Contact":"","Capabilities":"Plug and Play Health connects the best startups in the world to healthcare corporations who want to disrupt the industry. Plug and Play Health focuses on digital health technologies that challenge clinical practices, improve data analytics, and enhance the patient journey across the continuum of care. Headquartered in Silicon Valley but with 28 offices all over the globe, they've accelerated over two hundred startups in partnership with more than twenty corporations.","Powers":"Plug and Play Health connects the best startups in the world to healthcare corporations who want to disrupt the industry. Plug and Play Health focuses on digital health technologies that challenge clinical practices, improve data analytics, and enhance the patient journey across the continuum of care. Headquartered in Silicon Valley but with 28 offices all over the globe, they've accelerated over two hundred startups in partnership with more than twenty corporations.","logobg":"y","Website":"https://www.plugandplaytechcenter.com"}},{"type":"Feature","geometry":{"type":"Point","coordinates":[-92.3277375,38.9403808]},"properties":{"Name":"University of Missouri Midwest BioAccelerator","Address":"321 University Hall, Columbia, MO 65211 ","logofile":"bioaccelerator_logo.png","Contact":"j.v.abbey@umsystem.edu ","Capabilities":"The University of Missouri Midwest BioAccelerator (MU-MBar) is focused on boosting biosecurity and biodefense research, leveraging partnerships with industry leaders and searching for solutions to national health security threats. With resources including the USDA and the Midwest Research Institute in Kansas City, Washington University in St. Louis, and the MU Research Reactor, among other research labs in Columbia, Missouri, the work will focus on both human and animal health, creating development opportunities for new technology associated with detecting and mitigating infectious diseases.","Powers":"","logobg":"y","Website":"(under construction)"}},{"type":"Feature","geometry":{"type":"Point","coordinates":[-93.203628,44.971327]},"properties":{"Name":"University Enterprise Laboratories and generator","Address":"1000 Westgate Drive, Saint Paul, MN 55114","logofile":"uel_logo.png","Contact":"info@uelmn.org ","Capabilities":"A non-profit 501(c)(3) organization, established in 2004, University Enterprise Laboratories (UEL) are a connector and active contributor to the Twin Cities' innovation ecosystem. They support growth in life sciences, biotech, healthcare, and other science/technology industries. UEL is partnering with gener8tor to provide services for BARDA DRIVe.","Powers":"A non-profit 501(c)(3) organization, established in 2004, University Enterprise Laboratories (UEL) are a connector and active contributor to the Twin Cities' innovation ecosystem. They support growth in life sciences, biotech, healthcare, and other science/technology industries. UEL is partnering with gener8tor to provide services for BARDA DRIVe.","logobg":"y","Website":"https://www.uelmn.org/"}},{"type":"Feature","properties":{"Name":"Biolocity","logobg":"y","logofile":"Biolocity-logo-tag-color-0919.png","Address":"387 Technology Circle NW, Atlanta, GA 30313","Website":"http://www.biolocity.org","Contact":"Biolocity@gatech.edu","Capabilities":"Biolocity is a philanthropic, multi-institutional network supporting university medical technology commercialization in the southeast. Through a combination of investment, project management, consulting, and educational programming, Biolocity provides early-stage, patient impacting technologies with the resources needed to reach critical commercialization milestones","Powers":"Biolocity is a philanthropic, multi-institutional network supporting university medical technology commercialization in the southeast. Through a combination of investment, project management, consulting, and educational programming, Biolocity provides early-stage, patient impacting technologies with the resources needed to reach critical commercialization milestones"},"geometry":{"type":"Point","coordinates":[-98.41552734375,47.96050238891509]}}]}